ua1arn/hftrx/boards/arm_stm32f4xx_tqfp144_ctlstyle_storch_v5.h
		#if WITHPOTWPM
			POTWPM = 6,			// PA6 потенциометр управления скоростью передачи в телеграфе
		#endif /* WITHPOTWPM */
		#if WITHPOTPOWER
			POTPOWER = 6,			// регулировка мощности
		#endif /* WITHPOTPOWER */

		#if WITHTHERMOLEVEL
			XTHERMOIX = BOARD_ADCMRRIN(2),		// NMEA ch
		#endif /* WITHTHERMOLEVEL */

		#if WITHCURRLEVEL
			#define WITHCURRLEVEL_ACS712_20A 1	// PA current sense - ACS712ELCTR-20B-T chip
			PASENSEIX = BOARD_ADCMRRIN(4),		// NMEA ch
		#endif /* WITHCURRLEVEL */

		#if WITHSWRMTR
			FWD = BOARD_ADCMRRIN(6), REF = BOARD_ADCMRRIN(7),	// PC5	SWR-meter
			PWRI = FWD,
		#endif /* WITHSWRMTR */

		#define VOLTLEVEL_UPPER		47	// 4.7 kOhm - верхний резистор делителя датчика напряжения
		#define VOLTLEVEL_LOWER		10	// 1 kOhm - нижний резистор

		// ST LM235Z
		#define THERMOSENSOR_UPPER		402	// 4020 Ohm - верхний резистор делителя датчика температуры
		#define THERMOSENSOR_LOWER		95	// 950 Ohm - нижний резистор
		#define THERMOSENSOR_OFFSET 	(- 2730)		// 2.98 volt = 25 Celsius, 10 mV/C
		#define THERMOSENSOR_DENOM	 	1			// миливольты к десятым долям градуса 2.98 volt = 25 Celsius

		XTHERMOMRRIX = BOARD_ADCMRRIN(8),	// кеш - индекc не должен повторяться в конфигурации
		PASENSEMRRIX = BOARD_ADCMRRIN(9),	// кеш - индекc не должен повторяться в конфигурации
		REFMRRIX = BOARD_ADCMRRIN(10),
		FWDMRRIX = BOARD_ADCMRRIN(11),
		PWRMRRIX = FWDMRRIX,
		VOLTMRRIX = BOARD_ADCMRRIN(12),	// кеш - индекc не должен повторяться в конфигурации
		PASENSEMRRIX2 = BOARD_ADCMRRIN(13),		// кеш - индекc не должен повторяться в конфигурации
		PAREFERMRRIX2 = BOARD_ADCMRRIN(14),		// кеш - индекc не должен повторяться в конфигурации

	#else
		#if WITHREFSENSOR
			VREFIX = 17,		// Reference voltage
		#endif /* WITHREFSENSOR */
		#if WITHTEMPSENSOR
			TEMPIX = 16,
		#endif /* WITHTEMPSENSOR */
		#if WITHVOLTLEVEL
			VOLTSOURCE = 8,		// PB0 Средняя точка делителя напряжения, для АКБ
		#endif /* WITHVOLTLEVEL */

		#if WITHPOTIFGAIN
			POTIFGAIN = 3,		// PA2 IF GAIN
		#endif /* WITHPOTIFGAIN */
		#if WITHPOTAFGAIN
			POTAFGAIN = 7,		// PA7 AF GAIN
		#endif /* WITHPOTAFGAIN */

		#if WITHPOTWPM
			POTWPM = 6,			// PA6 потенциометр управления скоростью передачи в телеграфе
		#endif /* WITHPOTWPM */
		#if WITHPOTPOWER
			POTPOWER = 6,			// регулировка мощности
		#endif /* WITHPOTPOWER */

			ALCINIX = 9,		// PB1 ALC IN

		#if WITHCURRLEVEL
			PASENSEIX = 2,		// PA2 PA current sense - ACS712-05 chip
		#endif /* WITHCURRLEVEL */

		#if WITHSWRMTR
			PWRI = 14,			// PC4
			FWD = 14, REF = 15,	// PC5	SWR-meter
		#endif /* WITHSWRMTR */

		XTHERMOMRRIX = BOARD_ADCMRRIN(0),	// кеш - индекc не должен повторяться в конфигурации
		PASENSEMRRIX = BOARD_ADCMRRIN(1),	// кеш - индекc не должен повторяться в конфигурации
		REFMRRIX = BOARD_ADCMRRIN(2),
		FWDMRRIX = BOARD_ADCMRRIN(3),
		PWRMRRIX = FWDMRRIX,
		VOLTMRRIX = BOARD_ADCMRRIN(4),	// кеш - индекc не должен повторяться в конфигурации
		PASENSEMRRIX2 = BOARD_ADCMRRIN(5),		// кеш - индекc не должен повторяться в конфигурации
		PAREFERMRRIX2 = BOARD_ADCMRRIN(6),		// кеш - индекc не должен повторяться в конфигурации
	#endif

		KI0 = 10, KI1 = 11, KI2 = 12, KI3 = 0, KI4 = 1	// клавиатура
	};

	#define KI_COUNT 5	// количество используемых под клавиатуру входов АЦП
	#define KI_LIST	KI4, KI3, KI2, KI1, KI0,	// инициализаторы для функции перекодировки

#endif /* ARM_STM32F4XX_TQFP144_CTLSTYLE_STORCH_V5_H_INCLUDED */
